# ElementArray Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementArray Constructor
ElementArray Class See Also
---
Initializes a new instance of the ElementArray class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementArray()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ElementArray()
```

# See Also
ElementArray Class
Autodesk.Revit.DB Namespace